app/views/notes/show.html.erb


			<%= link_to User.find(comment['user_id']).username, user_path(comment), class: "comment-username" %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."note_id" = $1  ORDER BY "comments"."created_at" DESC  [["note_id", 7]]