app/views/devise/registrations/new.html.erb

    <%= f.label :language_id %><br />
    <%= f.collection_select(:language_id, Language.all, :id, :name) %>
---
SELECT "languages".* FROM "languages"