app/views/users/index.html.erb

SELECT "languages".* FROM "languages" INNER JOIN "learnings" ON "languages"."id" = "learnings"."language_id" WHERE "learnings"."user_id" = $1  [["user_id", 2]]
---
		<ul>
			<% user.languages.each do |language| %>