app/views/users/list_users.html.erb

		<ul>
			<% user.languages.each do |language| %>
---
SELECT "languages".* FROM "languages" INNER JOIN "learnings" ON "languages"."id" = "learnings"."language_id" WHERE "learnings"."user_id" = $1  [["user_id", 1]]