app/views/users/preferences.html.erb

SELECT "languages".* FROM "languages"
---
    <%= f.label "Languages you're learning" %><br />
      <%= f.collection_check_boxes :language_ids, Language.all, :id, :name do |b| %>