app/controllers/comments_controller.rb

  def create
    new_comment = current_user.comments.create(:text => params[:comment][:text], :note_id => params[:note_id])
---
INSERT INTO "comments" ("text", "note_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "Testafasdfasd"], ["note_id", 3], ["user_id", 1], ["created_at", "2016-01-12 19:02:40.826481"], ["updated_at", "2016-01-12 19:02:40.826481"]]

  def destroy
    comment = Comment.destroy(params[:id])
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 4]]