app/controllers/home_controller.rb

  def questions
  	if user_signed_in?
  		@languages = current_user.languages
  	else
  		@languages = Language.all
  	end
  	@path = "/questions"
  	@q = Note.ransack(params[:q])
  	@notes = @q.result.where(question: true).order(:created_at).reverse_order
---
SELECT "languages".* FROM "languages" INNER JOIN "learnings" ON "languages"."id" = "learnings"."language_id" WHERE "learnings"."user_id" = $1  [["user_id", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."question" = $1  ORDER BY "notes"."created_at" DESC  [["question", "t"]]

  def new
  	if user_signed_in?
  		@languages = current_user.languages
  	else
  		@languages = Language.all
  	end
  	@path = "/new"
  	@q = Note.ransack(params[:q])
  	@notes = @q.result.where(private: nil).order(:created_at).reverse_order
---
SELECT "languages".* FROM "languages" INNER JOIN "learnings" ON "languages"."id" = "learnings"."language_id" WHERE "learnings"."user_id" = $1  [["user_id", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."private" IS NULL  ORDER BY "notes"."created_at" DESC