app/controllers/home_controller.rb

  def index
  	@notes = Note.all
---
SELECT "notes".* FROM "notes"  ORDER BY "notes"."created_at" DESC