app/controllers/notes_controller.rb

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT 1  [["id", nil]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "languages".* FROM "languages" WHERE "languages"."id" = $1 LIMIT 1  [["id", 10]]
SELECT "comments".* FROM "comments" WHERE "comments"."note_id" = $1  ORDER BY "comments"."created_at" DESC  [["note_id", 7]]
---
  def show
    @note = Note.find(params[:id])
    @user = User.find(@note['user_id'])
    @language = Language.find(@note['language_id'])
    @comment = Comment.new
    @comments = @note.comments.order(:created_at).reverse_order

INSERT INTO "notes" ("title", "body", "source", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Test2"], ["body", "Test body 2"], ["source", "Test source 2"], ["user_id", 1], ["created_at", "2016-01-12 16:04:05.723086"], ["updated_at", "2016-01-12 16:04:05.723086"]]
---
  def create
    new_note = current_user.notes.create(note_params)

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT 1  [["id", 3]]
---
  def edit
    @note = Note.find(params[:id])

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "notes" SET "title" = $1, "updated_at" = $2 WHERE "notes"."id" = $3  [["title", "What does chien mean? sdfasdfas dfasd fas dfa sdf asdf asd fasd fa sdf asd fasdfasd"], ["updated_at", "2016-01-13 20:15:10.219157"], ["id", 10]]
---
  def update
    note = Note.find(params[:id])
    note.update(note_params)

DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 1]]
---
  def destroy
    Note.destroy(params[:id])