app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 7]]
SELECT "languages".* FROM "languages" INNER JOIN "learnings" ON "languages"."id" = "learnings"."language_id" WHERE "learnings"."user_id" = $1  [["user_id", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = $1  ORDER BY "notes"."created_at" DESC  [["user_id", 1]]
---
  def show
  	@user = User.find(params[:id])
    if user_signed_in?
      @languages = current_user.languages
    else
      @languages = Language.all
    end
    @path = user_path
    @q = Note.ransack(params[:q])
    @notes = @q.result.where(user_id: params[:id]).order(:created_at).reverse_order

SELECT "users".* FROM "users"
---
  def list_users
  	@users = User.all

SELECT "users".* FROM "users"
INSERT INTO "learnings" ("user_id", "language_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 7], ["language_id", 1], ["created_at", "2016-01-12 14:29:02.451022"], ["updated_at", "2016-01-12 14:29:02.451022"]]
---
  def set_preferences

  	language_ids = params[:user][:language_ids]

  	language_ids.each do |id|
  		new_learning = Learning.new(user_id: params[:user_id], language_id: id)
  		new_learning.save