app/views/application/_homenotes.html.erb

SELECT "notes".* FROM "notes"  ORDER BY "notes"."created_at" DESC
---

		<i class="fa fa-comments"></i><%= link_to "#{note.comments.length} Comments", note_path(note), class: "note-comments-label" %>